[
  {
    "id": 1,
    "title": "Red Bull Glazed Chicken Wings",
    "category": "Main Dishes",
    "image": "https://images.unsplash.com/photo-1567620832903-9fc6debc209f?w=800&q=80",
    "time": "12 hrs 55 min",
    "servings": 2,
    "difficulty": "Medium",
    "description": "An incredibly unique and flavorful take on chicken wings. The wings are first marinated in Red Bull with aromatic herbs, then coated in cornstarch for an ultra-crispy baked texture, and finally glazed with a sweet, tangy, and buttery Red Bull reduction sauce. A surprising and delicious fusion of energy drink and classic wing flavors.",
    "ingredients": [
      "300g chicken wings",
      "3-4 bay leaves",
      "7-10 whole black peppercorns",
      "2 cans Red Bull",
      "Cornstarch, enough for coating",
      "1 can Red Bull (for the sauce)",
      "2 large spoons of honey",
      "50g butter",
      "1 whole lime",
      "70g ketchup (4 tablespoons)"
    ],
    "instructions": [
      "In a bowl, place the wings, bay leaves, peppercorns, and Red Bull.",
      "Cover with plastic wrap and refrigerate for 12 hours.",
      "Remove the bowl from the fridge and discard the liquid.",
      "Coat the wings one by one in cornstarch, pressing firmly with your fingers so it sticks well.",
      "Place them on a baking tray lined with parchment paper.",
      "Preheat the oven to 180°C (350°F) with the fan setting.",
      "Place the tray in the oven and bake for 25 minutes.",
      "In a pot, combine Red Bull, honey, butter, lime (juice and/or zest), and ketchup. Cook over medium heat, stirring occasionally, until it boils.",
      "Once boiling, reduce heat to low and let it simmer for 10-15 minutes until thickened.",
      "Remove the wings from the oven and place them in the pot with the sauce, mixing carefully to coat.",
      "Put the wings back on the tray and spoon a little more sauce over each one.",
      "Return to the oven for another 15 minutes.",
      "Strain the remaining sauce and pour it onto the serving plate.",
      "Remove the wings from the oven and place them on the plate.",
      "Grate lime zest (only the green part) over the wings (the white part is bitter)."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 2,
    "title": "Fig and Burrata Salad",
    "category": "Salads",
    "image": "https://images.unsplash.com/photo-1546793665-c74683f339c1?w=800&q=80",
    "time": "20 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "An elegant and sophisticated salad that combines the sweetness of caramelized figs with the saltiness of ham and the creamy richness of burrata cheese. The homemade honey-lime dressing ties all the flavors together perfectly, creating a stunning starter or light main course.",
    "ingredients": [
      "4-5 figs",
      "Arugula (rocket)",
      "1 Burrata cheese",
      "Ham (prosciutto or serrano)",
      "Sugar",
      "20g butter",
      "70ml olive oil",
      "2 spoons honey",
      "1/2 small teaspoon Worcestershire sauce (or 1 dessert spoon)",
      "1/2 lime, juiced"
    ],
    "instructions": [
      "Cut the figs into quarters.",
      "In a hot pan over low heat, melt 20g of butter.",
      "Coat each side of the figs with sugar and sear in the pan for 1 minute per side.",
      "In a bowl, combine olive oil, honey, Worcestershire sauce, and lime juice.",
      "Mix well until you get a smooth, creamy texture.",
      "On a plate, arrange arugula, leaving space in the center.",
      "Distribute the figs and ham over the arugula and place the burrata in the center.",
      "With a spoon, drizzle the dressing over the entire salad, including the burrata."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 3,
    "title": "Hake with Thyme, Basil, Garlic, and Lime",
    "category": "Main Dishes",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQBvTvClVyEijXQkFEpNapVTj1bcDtutNg0ZA&s",
    "time": "25 min",
    "servings": 1,
    "difficulty": "Easy",
    "description": "A light, fresh, and incredibly flavorful fish dish. Hake fillets are marinated in a vibrant herb paste with thyme, basil, garlic, and lime zest, then quickly seared to perfection. Served with mashed potatoes and a simple side of cherry tomatoes and radish, it's a healthy and restaurant-quality meal.",
    "ingredients": [
      "1 defrosted hake fillet",
      "1 lime",
      "60ml olive oil",
      "2 garlic cloves",
      "1 spoon chopped basil",
      "1 spoon chopped thyme",
      "Mashed potatoes (for serving)",
      "3 cherry tomatoes",
      "1/2 radish"
    ],
    "instructions": [
      "In a bowl, combine olive oil, basil, thyme, grated garlic, and lime zest (only the green part).",
      "Mix everything and pour it over the fish.",
      "Spread it well over the entire fish with your fingers.",
      "Heat a pan over medium heat and place the hake skin-side down.",
      "Sear for 1 minute on each side.",
      "On a plate, add a spoonful of mashed potatoes and place the hake next to it.",
      "Place the halved cherry tomatoes and sliced radish on top of the mash.",
      "Drizzle a little olive oil on top and it's ready."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 4,
    "title": "Chinese Steamed Egg",
    "category": "Appetizers",
    "image": "https://www.trangskitchentable.com/wp-content/uploads/2024/09/SteamedEgg_Feature.jpg",
    "time": "20 min",
    "servings": 1,
    "difficulty": "Easy",
    "description": "A silky-smooth, savory Chinese egg custard, steamed to perfection. Known as 'Zheng Dan' or 'Chawanmushi' (Japanese style), this dish has a delicate, jiggly texture that melts in your mouth. It's a simple, comforting, and protein-packed dish, often enjoyed for breakfast or as a light side.",
    "ingredients": [
      "3 eggs",
      "Boiled water",
      "2g salt",
      "1 tablespoon soy sauce"
    ],
    "instructions": [
      "Bring water to a boil.",
      "Crack the eggs into a heatproof bowl.",
      "When the water boils, use a ladle to add the boiled water to the bowl with the eggs and whisk quickly so the egg doesn't cook. The ratio should be 1.5 parts water to 1 part egg.",
      "Add salt to taste (2-3 grams).",
      "In the pot, place a plate or something on the bottom to act as a trivet, then place the bowl with the egg mixture on top and cover.",
      "Cover and turn off the heat. Let it sit covered for 10-15 minutes.",
      "Lift the lid, remove the bowl, cut into squares, and add at most 1 tablespoon of soy sauce."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 5,
    "title": "Creamy Pumpkin Soup",
    "category": "Soups",
    "image": "https://www.healthyfood.com/wp-content/uploads/2019/07/Creamy-pumpkin-soup.jpg",
    "time": "40 min",
    "servings": 4,
    "difficulty": "Easy",
    "description": "The ultimate autumn comfort food. This velvety smooth pumpkin soup is naturally sweet, hearty, and warming. The addition of cream (optional) makes it luxuriously rich, while a hint of nutmeg adds a classic, aromatic depth. Topped with crunchy pumpkin seeds and croutons for the perfect finish.",
    "ingredients": [
      "500g pumpkin (peeled and cubed)",
      "2 medium potatoes (peeled and cubed)",
      "1 large onion (peeled and cubed)",
      "2 tablespoons olive oil (or butter)",
      "250ml vegetable broth",
      "100ml cooking cream (optional, for extra creaminess)",
      "Salt and pepper to taste",
      "Nutmeg (optional, a very tasty touch)",
      "Toasted pumpkin seeds and bread croutons (optional, for garnish)"
    ],
    "instructions": [
      "Sauté the vegetables: In a large pan, heat the olive oil over medium heat.",
      "Add the vegetables and sauté for 5-7 minutes, until golden.",
      "Cook: Add the vegetables to water (about 750ml).",
      "Bring to a boil, then reduce heat and cook for about 20-25 minutes, until the pumpkin and potato are very tender.",
      "Blend: Use a hand blender (or countertop blender) to blend everything until you get a creamy texture.",
      "If it's too thick, you can add a little more water.",
      "Add cream and season: Incorporate the cooking cream if you want a richer, creamier texture.",
      "Season with salt, pepper, and a pinch of nutmeg to taste.",
      "Cook for 5 more minutes over low heat, without boiling.",
      "Serve: Serve hot, decorated with a drizzle of oil, pumpkin seeds, a few parsley leaves, and croutons."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 6,
    "title": "Classic Pumpkin Pie",
    "category": "Desserts",
    "image": "https://www.splenda.com/wp-content/uploads/2023/09/Pumpkin-Pie-website-2371-2000x1000.jpg",
    "time": "1 hr 30 min",
    "servings": 8,
    "difficulty": "Medium",
    "description": "The quintessential fall dessert. This pumpkin pie features a flaky, buttery homemade crust filled with a spiced, velvety smooth pumpkin custard. It's perfectly sweetened and spiced with cinnamon and nutmeg, creating that iconic flavor everyone loves during the holidays.",
    "ingredients": [
      "For the crust:",
      "200g flour",
      "100g cold butter",
      "1 egg",
      "2 tablespoons sugar",
      "1 pinch of salt",
      "2–3 tablespoons cold water",
      "For the filling:",
      "500g pumpkin puree (baked or cooked, well-drained)",
      "250ml whipping cream (min. 35% fat)",
      "3 eggs",
      "120g sugar (you can use half brown, half white)",
      "1 teaspoon ground cinnamon",
      "½ teaspoon nutmeg (optional)",
      "1 pinch of salt"
    ],
    "instructions": [
      "The crust: Mix the flour with salt and sugar.",
      "Add the cold butter in cubes and rub it in until you have a sandy texture.",
      "Incorporate the egg and water little by little until a dough forms.",
      "Wrap in plastic wrap and refrigerate for 30 minutes.",
      "Roll out the dough, place it in a pie dish, prick with a fork, and bake at 180°C for 10 minutes with weights on top (so it doesn't rise).",
      "Mix the filling: In a bowl, beat the eggs with the sugar until slightly frothy.",
      "Add the liquid cream and mix well.",
      "Incorporate the pumpkin puree, cinnamon, nutmeg, and the pinch of salt.",
      "Assemble the pie: Pour the mixture into the pre-baked crust.",
      "Bake: 180°C for 45–50 minutes, until the center is almost set but still wobbles slightly when the pan is moved.",
      "Cool: Let cool to room temperature and then refrigerate for at least 2 hours before serving."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 7,
    "title": "Homemade Pumpkin Ice Cream",
    "category": "Desserts",
    "image": "https://images.unsplash.com/photo-1563805042-7684c019e1cb?w=800&q=80",
    "time": "4 hrs 20 min",
    "servings": 6,
    "difficulty": "Medium",
    "description": "A delightful and creamy frozen treat that captures the essence of autumn. This no-churn pumpkin ice cream is spiced with cinnamon, ginger, and nutmeg, offering all the cozy flavors of pumpkin pie in a cool, refreshing form. It's surprisingly easy to make and is the perfect end to a holiday meal.",
    "ingredients": [
      "300g pumpkin puree (baked or cooked, drained and mashed)",
      "200ml whipping cream (min. 35% fat)",
      "200ml whole milk",
      "120g sugar (adjust to taste or use honey/syrup)",
      "1 teaspoon ground cinnamon",
      "½ teaspoon ginger powder (optional)",
      "¼ teaspoon nutmeg",
      "1 pinch of salt",
      "1 teaspoon vanilla extract"
    ],
    "instructions": [
      "Prepare the base: Mix the pumpkin puree with sugar, spices, vanilla, and the pinch of salt.",
      "Add the milk and stir well.",
      "Whip the cream: Whip the cold cream until semi-whipped (has body, but is not too firm).",
      "Combine: Gently fold the cream into the pumpkin mixture with soft, enveloping movements.",
      "Freeze: If you have an ice cream maker, pour the mixture in and churn according to instructions (30–40 min).",
      "If you don't have an ice cream maker: Place the mixture in a container, freeze and stir with a fork every 30–40 minutes for 3–4 hours to break up the ice crystals.",
      "Serve: Remove the ice cream 5 minutes before serving to allow it to soften."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 8,
    "title": "Perfect Poached Egg",
    "category": "Breakfast",
    "image": "https://www.simplyrecipes.com/thmb/sd6S2C_cabT3N2la11w4Y_LwmA4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Simply-Recipes-Poached-Eggs-Lead-3a-db81f4e1d29146b0ab8db27f3fad8063.jpg",
    "time": "10 min",
    "servings": 1,
    "difficulty": "Easy",
    "description": "Master the art of the perfect poached egg. This method yields an egg with a firm, set white and a gloriously runny, creamy yolk. The optional vinegar helps the white coagulate faster for a neater shape. A fundamental skill for elevating breakfast, salads, and bowls.",
    "ingredients": [
      "1 fresh egg",
      "1 liter water",
      "1 tablespoon white vinegar (optional, helps coagulate the white)",
      "Salt to taste"
    ],
    "instructions": [
      "Heat the water: Place a pot with water over medium heat. It should not be at a rolling boil, just maintain a slight simmer (ideal temperature: about 85–90°C).",
      "Add vinegar (optional): Add a tablespoon of vinegar to the water. This helps the white stay together around the yolk.",
      "Prepare the egg: Crack the egg into a small cup or ramekin to make it easier to transfer to the water without breaking.",
      "Create a whirlpool: With a spoon, stir the water in circles to form a gentle whirlpool.",
      "Add the egg: Gently drop the egg into the center of the whirlpool. The water movement will help wrap the white around the yolk.",
      "Cook: Leave the egg for 3 to 4 minutes so the white sets but the yolk remains creamy.",
      "Remove and drain: Remove it with a slotted spoon and place it on a paper towel to remove excess water.",
      "Serve: Add a little salt and enjoy on toast, salad, rice, or whatever you prefer."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
{
    "id": 9,
    "title": "Crispy Breaded Chickpeas with Poached Eggs and Pico de Gallo",
    "category": "Breakfast",
    "image": "https://www.liveeatlearn.com/wp-content/uploads/2025/04/pesto-chickpea-eggs-11.jpg",
    "time": "40 min",
    "servings": 2,
    "difficulty": "Medium",
    "description": "A vibrant and protein-packed breakfast or brunch dish. Crispy, golden-brown breaded chickpeas serve as a fantastic vegetarian alternative to meat, topped with perfectly poached eggs with runny yolks and a fresh, zesty homemade Pico de Gallo. A delightful explosion of textures and flavors.",
    "ingredients": [
      "For the breaded chickpeas:",
      "200g cooked chickpeas (canned, well-drained)",
      "1 beaten egg",
      "Flour",
      "Salt, pepper, and paprika (optional)",
      "Olive oil",
      "For the poached eggs:",
      "2 fresh eggs",
      "Water and a splash of vinegar (1-2 spoons max)",
      "For the Pico de Gallo:",
      "2 ripe tomatoes, diced",
      "½ red onion, finely diced",
      "1 chili or jalapeño (optional, to taste)",
      "A handful of fresh cilantro, chopped",
      "Juice of 1 lime or lemon",
      "Salt and pepper",
      "For decoration:",
      "Lettuce or salad mix",
      "Cheese",
      "Lime zest",
      "Aioli"
    ],
    "instructions": [
      "Breaded Chickpeas:",
      "Drain and dry the chickpeas well with paper towels.",
      "Season with salt, pepper, and a little paprika.",
      "In a bowl, beat the egg with flour and water to form a batter.",
      "Heat oil in a pan.",
      "Coat the chickpeas in the batter and then carefully place them in the hot oil with a spoon.",
      "When golden brown, remove them to a tray with paper towels.",
      "Poached Eggs:",
      "Heat water in a small pot and add a splash of vinegar.",
      "When it's gently simmering, create a small whirlpool with a spoon.",
      "Crack the egg into a cup and gently slide it into the center.",
      "Cook for 3-4 minutes until the white is set and the yolk is runny.",
      "Remove with a slotted spoon and drain on paper towels.",
      "Pico de Gallo:",
      "Mix the tomato, onion, chili, and cilantro.",
      "Add salt, pepper, and lime juice.",
      "Let it rest for a few minutes for the flavors to meld.",
      "Assembly:",
      "Create a bed of lettuce on plates. Add the breaded chickpeas, top with poached eggs and Pico de Gallo. Garnish with lime zest and a drizzle of aioli."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 10,
    "title": "Coconut Milk Oatmeal with Orange and Lime",
    "category": "Breakfast",
    "image": "https://lh6.googleusercontent.com/proxy/LgvjJyCKRqdgbjSg2ah0g-vIvFskOA8kHOufmcGLwkkHtrgH5uedkSlLPAxRl7WNyyXZD0Nm72VGb3peNaT3YEv2-6_nMnroLBWPRK0exbBMET7Iuit_XYzis-t7BfaGmb0",
    "time": "20 min",
    "servings": 1,
    "difficulty": "Easy",
    "description": "A creamy, tropical, and comforting oatmeal made with coconut milk and infused with the bright flavors of orange and lime zest. This is not your ordinary porridge; it's a fragrant and sophisticated start to the day, finished with fresh orange segments for a burst of freshness.",
    "ingredients": [
      "½ cup rolled oats",
      "1 cup water or milk (can use plant-based or dairy)",
      "Pinch of salt",
      "Sweetener (1 spoon of honey, 1 spoon of sugar)",
      "Zest of half an orange",
      "Zest of half a lime",
      "Juice of half a lime",
      "1 Orange",
      "Cinnamon 1-2 grams",
      "Butter for toasting"
    ],
    "instructions": [
      "In a pot over low heat, add butter and the oats.",
      "Toast until golden brown.",
      "Strain the oats in a colander to remove excess butter, then return them to the pot.",
      "Add milk and wait for it to boil. Just before boiling, add the cinnamon, sugar, and honey.",
      "When it boils, turn off the heat and cover. Let it sit covered for 10 minutes.",
      "Cut the orange into segments.",
      "On a plate, place the oatmeal, pour over the leftover orange juice, and add the orange segments.",
      "Top with orange zest, lime zest, and lime juice."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 11,
    "title": "Gourmet Blood Sausage and Apple Sandwich",
    "category": "Main Dishes",
    "image": "https://images.unsplash.com/photo-1551504734-5ee1c4a1479b?w=800&q=80",
    "time": "45 min",
    "servings": 2,
    "difficulty": "Medium",
    "description": "An elevated sandwich experience. This gourmet 'bocata' combines the rich, earthy flavor of crispy blood sausage with sweet caramelized onions, tangy sautéed apple, creamy melted goat cheese, and fresh arugula. A masterpiece of contrasting textures and sophisticated flavors.",
    "ingredients": [
      "1 Burgos-style blood sausage (or similar)",
      "1 Reinette or Granny Smith apple (sour, for contrast)",
      "1 red onion (milder and more colorful than white)",
      "Brioche-style bread, muffin, or thin ciabatta",
      "Goat cheese log (brie or camembert also work)",
      "A few arugula or lamb's lettuce leaves",
      "Butter + olive oil",
      "Salt, pepper, and a touch of fresh thyme or rosemary",
      "(Optional) Pedro Ximénez reduction or liquid honey"
    ],
    "instructions": [
      "Caramelized Onion:",
      "Cut the red onion into thin strips.",
      "Cook it over low heat with a splash of oil and a pinch of salt.",
      "When tender and sweet (15-20 min), add a splash of balsamic or sherry vinegar and let it reduce.",
      "Caramelized Apple:",
      "Peel and cut the apple into thin wedges.",
      "Sauté in butter with a little fresh thyme or rosemary.",
      "At the end, add a few drops of honey or brown sugar to lightly caramelize.",
      "Crispy Blood Sausage:",
      "Remove the casing from the blood sausage and cut into thick slices.",
      "Sear them in a pan with a little oil until crispy on the outside and soft inside.",
      "Melted Cheese:",
      "Cut slices of goat cheese.",
      "Broil them for 2-3 minutes in a hot oven or with a torch until golden.",
      "Sandwich Assembly:",
      "Open the bread and toast it lightly so it holds up to the juices.",
      "Base of caramelized onion.",
      "On top, the blood sausage slices.",
      "Then the caramelized apple wedges.",
      "Top with the melted cheese and a few arugula leaves for freshness.",
      "(Optional) Drizzle a thread of Pedro Ximénez reduction or honey on top to finish."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 12,
    "title": "Butter-Style Rice",
    "category": "Side Dishes",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ4JeHZYviNhd-96d3Ueu6VFvdp5Zir6Zmj0g&s",
    "time": "25 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "The simplest way to elevate plain rice. By lightly toasting the rice in butter before steaming, you unlock a wonderful nutty flavor and ensure each grain is perfectly separate and fluffy. A versatile side for countless main courses.",
    "ingredients": [
      "1 cup rice",
      "2 cups water",
      "1–2 tablespoons butter",
      "Salt to taste"
    ],
    "instructions": [
      "Wash the rice well with cold water until the water runs clear.",
      "In a skillet or pot, melt the butter over low heat and gently sauté the rice.",
      "Add the water (and salt if desired).",
      "When it starts to boil, let it cook for 5 minutes.",
      "Turn off the heat, cover the pot, and let it rest for 15 to 20 minutes.",
      "Uncover and serve hot."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 13,
    "title": "Seafood Bisque Sauce",
    "category": "Sauces",
    "image": "https://images.unsplash.com/photo-1541014741259-de529411b96a?w=800&q=80",
    "time": "1 hr",
    "servings": 4,
    "difficulty": "Medium",
    "description": "A luxurious, velvety smooth seafood bisque. This classic French sauce is deeply flavorful, made from shrimp shells (or lobster/crab), aromatic vegetables, brandy, and white wine, finished with cream. Perfect for enriching pasta, risotto, or simply serving with crusty bread.",
    "ingredients": [
      "500 g shrimp heads and shells (or lobster/crab)",
      "1 chopped onion",
      "1 chopped carrot",
      "1 chopped celery stalk",
      "2 chopped garlic cloves",
      "2 tbsp tomato paste",
      "100 ml brandy or cognac (optional, adds deep flavor)",
      "200 ml white wine",
      "1 liter fish stock or shellfish broth",
      "200 ml heavy cream",
      "2 tbsp butter",
      "2 tbsp flour (for thickening, optional)",
      "Olive oil",
      "Salt and pepper to taste",
      "Herbs: bay leaf, thyme, or parsley (optional)"
    ],
    "instructions": [
      "Sauté the Shells: In a large pot, heat a little oil and sauté the heads and shells until they change color and release their aroma.",
      "Add Vegetables: Add the onion, carrot, celery, and garlic. Cook until lightly browned.",
      "Incorporate Tomato Paste: Add it and stir well to caramelize slightly.",
      "Deglaze with Brandy and Wine: Pour in the brandy and flambé (if desired) or let the alcohol evaporate. Add the white wine and reduce by half.",
      "Cook with Broth: Add the fish stock and herbs. Cook over medium-low heat for 30-40 minutes.",
      "Blend and Strain: Remove the herbs, blend everything with a blender, and pass through a fine-mesh strainer or chinois to obtain a smooth cream.",
      "Enrich with Cream and Butter: Return the bisque to low heat, add the heavy cream and a little cold butter. Adjust salt and pepper."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 14,
    "title": "Pasta with Shrimp and Bisque Sauce",
    "category": "Main Dishes",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTdN4TociPbDYG1CxWBxsYvzo2zhchUx5RSDQ&s",
    "time": "45 min",
    "servings": 2,
    "difficulty": "Medium",
    "description": "A restaurant-worthy pasta dish where the pasta cooks directly in the incredibly flavorful homemade bisque sauce, absorbing all its essence. Topped with a fresh shrimp tartare, this method ensures an intense seafood flavor in every bite.",
    "ingredients": [
      "400g Argentine red shrimp",
      "3–4 tablespoons olive oil",
      "Juice and zest of 1 lemon",
      "Salt and black pepper to taste",
      "200g sweet tomatoes",
      "250g dried pasta",
      "Vegetables for the broth (onion, carrot, celery) – 1 of each",
      "Water or fish stock – approx. 700 ml"
    ],
    "instructions": [
      "Shrimp Tartare:",
      "Peel the shrimp and remove the intestine.",
      "Cut the meat into small cubes.",
      "Add olive oil, salt, pepper, lemon juice, and zest.",
      "Mix and reserve in the refrigerator.",
      "Bisque Sauce:",
      "Sauté the chopped vegetables in a pan.",
      "Add the shrimp heads and shells and brown them.",
      "Pour in water or fish stock.",
      "Cook over low heat for about 20 minutes.",
      "Strain to obtain an aromatic broth.",
      "Pasta:",
      "In a pan with olive oil, sauté the sweet tomatoes.",
      "Add the dried pasta directly to the pan.",
      "Gradually incorporate the Bisque broth, allowing the pasta to absorb it as it cooks.",
      "Cook until the pasta is al dente and the liquid reduces to a creamy sauce.",
      "Serve the pasta topped with the reserved shrimp tartare."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 15,
    "title": "Creamy Pepper, Bell Pepper and Dijon Mustard Sauce",
    "category": "Sauces",
    "image": "https://www.smokingchimney.com/recipe-pages/images/1x1/mustard-and-pepper-sauce-500x400.jpg",
    "time": "25 min",
    "servings": 4,
    "difficulty": "Easy",
    "description": "A rich and velvety sauce with a perfect balance of heat from black pepper, tang from Dijon mustard, and subtle sweetness from bell peppers. This versatile cream sauce is excellent with grilled meats, roasted vegetables, or pasta.",
    "ingredients": [
      "1 teaspoon black peppercorns (freshly crushed or mashed)",
      "1-2 tablespoons butter",
      "½ onion (chopped)",
      "1 garlic clove (chopped)",
      "½ cube or 1 teaspoon concentrated beef broth (or 50 ml beef stock)",
      "1 stuffed green bell pepper (can be meat or rice stuffed, already cooked)",
      "1 sprig of fresh rosemary (or ½ teaspoon dried)",
      "150 ml cooking cream",
      "1 additional tablespoon butter (for finishing)",
      "1 teaspoon Dijon mustard",
      "Salt to taste"
    ],
    "instructions": [
      "Toast the Pepper: In a skillet, without any oil, lightly toast the crushed black peppercorns for a few seconds until they release their aroma.",
      "Sauté with Butter: Add butter to the skillet with the pepper. When melted, add the chopped onion and garlic.",
      "Cook over medium-low heat until they begin to caramelize (about 10 minutes).",
      "Add Base and Flavorings: Add the concentrated beef broth or liquid stock. Incorporate the chopped stuffed bell pepper (if very large, cut into cubes). Also add the rosemary.",
      "Incorporate the Cream: Pour in the cooking cream and mix well. Cook everything together for 5 minutes over low heat to allow the flavors to meld.",
      "Finish with Butter and Mustard: Turn off the heat. Add the last tablespoon of butter and the Dijon mustard. Mix until well incorporated.",
      "Blend: Pour the mixture into a blender or use an immersion blender. Blend until you get a smooth and creamy sauce."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 16,
    "title": "Skillet Caramelized Onions with Sugar, Honey and Brandy",
    "category": "Side Dishes",
    "image": "https://assets.bonappetit.com/photos/62e2e1712b8dd2f74bfc0e92/16:9/w_1280,c_limit/0728-carmalized-onions-lede.jpg",
    "time": "25 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "Deeply flavorful onions caramelized in the same pan used to cook meat, capturing all the delicious browned bits. Sweetened with sugar and honey and deglazed with brandy, these onions are the perfect gourmet topping for steaks, burgers, or sausages.",
    "ingredients": [
      "2 large onions (white or sweet), julienned",
      "1 tablespoon sugar (brown or white)",
      "1 tablespoon honey",
      "30-50 ml brandy (or cognac)",
      "1-2 tablespoons water or broth (if needed)",
      "Salt to taste",
      "Olive oil (if necessary)"
    ],
    "instructions": [
      "Cook the Meat: Cook your meat in a skillet (steak, burger, etc.) with a little oil. Do not clean the skillet after removing the meat, as those remnants ('fond') will add great flavor to the onions.",
      "Add the Onions: Reduce to medium heat. If the skillet is too dry, add a teaspoon of oil. Add the julienned onions and a pinch of salt.",
      "Cook, stirring occasionally, until translucent and soft (about 10 minutes).",
      "Caramelize with Sugar and Honey: Add the sugar and honey, mix well. Cook slowly over medium-low heat for 5-10 minutes, stirring to prevent burning.",
      "Deglaze with Brandy: Increase the heat a little and add the brandy. Scrape the bottom of the skillet well with a wooden spoon to lift up the flavors.",
      "Let the alcohol reduce for 2-3 minutes, until you have a thick and shiny sauce.",
      "Adjust Texture: If it becomes too dry, you can add a tablespoon of water or broth to thin it. Adjust salt to taste."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 17,
    "title": "Spanish Omelette with Caramelized Onions",
    "category": "Main Dishes",
    "image": "https://images.unsplash.com/photo-1572453800999-e8d2d1589b7c?w=800&q=80",
    "time": "1 hr 15 min",
    "servings": 4,
    "difficulty": "Medium",
    "description": "The ultimate Spanish comfort food. This version features slowly caramelized onions that add a wonderful sweetness and depth of flavor to the classic potato and egg omelette. Moist, flavorful, and perfect served warm or at room temperature.",
    "ingredients": [
      "5-6 medium potatoes (approx. 800g)",
      "6 eggs",
      "2-3 large onions (sweet or normal)",
      "Extra virgin olive oil (abundant for frying)",
      "Salt to taste",
      "1 teaspoon sugar (optional, to aid caramelization)",
      "A splash of vinegar (optional)"
    ],
    "instructions": [
      "Caramelize the Onion: Peel and cut the onions into julienne (thin strips). In a skillet with a little olive oil (2-3 tablespoons), cook the onion over very low heat with a pinch of salt.",
      "Cook slowly for 30-40 minutes, stirring occasionally. If you want to aid caramelization, you can add a teaspoon of sugar and a few drops of vinegar halfway through cooking.",
      "The onion should be golden, soft, and sweet. (You can do this step in advance).",
      "Prepare the Potatoes: Peel and cut the potatoes into thin slices or small cubes (according to preference).",
      "Fry them in abundant olive oil over medium heat (not too high, they should cook and brown slightly, not become crispy). Add salt to taste.",
      "Stir occasionally to prevent sticking and ensure even cooking. They will take about 20-25 minutes to become tender.",
      "🟡 Lighter option: Cook them in the microwave with a little oil and salt, covered with plastic wrap, until soft (approx. 8-10 min).",
      "Drain and Mix: Once the potatoes are ready, drain them well from the oil and place them in a large bowl.",
      "Add the caramelized onion and mix well.",
      "Beat the Eggs: Beat the eggs in a large bowl with a little salt. Add the potato and onion mixture, and let it rest for about 10 minutes for the flavors to meld.",
      "Cook the Omelette: In a non-stick skillet (20-24 cm), add a little oil and heat it over medium heat.",
      "Pour in the mixture and cook over medium-low heat for 4-6 minutes, until set on the bottom.",
      "Flip using a flat plate or lid, and cook on the other side for another 3-4 minutes (depending on whether you want it runny or more cooked)."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 18,
    "title": "Homemade Chicken Milanese",
    "category": "Main Dishes",
    "image": "https://images.unsplash.com/photo-1632778149955-e80f8ceca2e8?w=800&q=80",
    "time": "30 min",
    "servings": 3,
    "difficulty": "Easy",
    "description": "Crispy, golden-brown breaded chicken cutlets that are tender and juicy on the inside. A classic comfort food that's perfect with a side salad, mashed potatoes, or simply with a wedge of lemon.",
    "ingredients": [
      "2 chicken breasts (you can slice them into cutlets or use pre-sliced milanesa)",
      "2 eggs",
      "1 cup breadcrumbs (can be panko or normal)",
      "½ cup wheat flour (for coating)",
      "1 garlic clove, minced or grated (optional)",
      "1 tablespoon chopped parsley (optional)",
      "Salt and pepper to taste",
      "Oil for frying (sunflower or corn, for example)",
      "Lemon (for serving, optional)"
    ],
    "instructions": [
      "Prepare the Chicken: If using whole breasts, cut them into thin cutlets. You can also pound them a little with a meat mallet (between plastic wrap) to make them even and more tender.",
      "Season with salt and pepper on both sides.",
      "Prepare the Breading Station: On one plate: place flour. In another: beat the eggs with the garlic and parsley if using. On another plate: place the breadcrumbs.",
      "Bread the Chicken: Pass each chicken cutlet in this order: Flour (shake off excess) -> Beaten egg -> Breadcrumbs, pressing well so it adheres.",
      "🔁 For extra crispiness, you can repeat egg + breadcrumbs once more (double breading).",
      "Fry: Heat abundant oil in a skillet (medium heat). When hot, fry the milanesas until golden and crispy (approx. 3-4 minutes per side).",
      "Remove to paper towels to drain excess oil."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 19,
    "title": "Shallot Sauce with White Wine, Capers and Butter",
    "category": "Sauces",
    "image": "https://images.unsplash.com/photo-1546833999-b9f581a1996d?w=800&q=80",
    "time": "20 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "An elegant, restaurant-quality pan sauce with a beautiful balance of flavors. The sweetness of caramelized shallots, the briny pop of capers, the acidity of white wine and lemon, all brought together with rich, glossy butter. Perfect for fish, chicken, or veal.",
    "ingredients": [
      "1 shallot (or ½ small onion), finely chopped",
      "1 garlic clove, finely chopped",
      "1 tablespoon capers",
      "100 ml dry white wine",
      "100 ml hot broth (chicken, vegetable, or fish, depending on the dish)",
      "2 tablespoons butter",
      "Salt and pepper to taste",
      "A splash of lemon juice (to taste)",
      "Fresh chopped parsley (optional, for finishing)"
    ],
    "instructions": [
      "Sauté Shallot and Garlic: In a skillet over medium heat, add a little oil or butter. Add the chopped shallot and garlic and cook slowly until they begin to caramelize (turn golden and soft).",
      "Add Capers: Incorporate the capers and sauté for one more minute, mixing well with the shallot and garlic.",
      "Deglaze with White Wine: Pour in the white wine and reduce the heat. Cook for 2-3 minutes, allowing the alcohol to evaporate and the liquid to reduce slightly.",
      "Add Broth and Deglaze the Pan: Add the hot broth to deglaze the skillet (gently scrape the bottom with a wooden spoon to lift all the caramelized flavors).",
      "Turn Off the Heat: Once the liquid is well reduced, you can turn off the heat.",
      "Emulsify with Butter: Add the 2 tablespoons of cold butter and mix well until melted and the liquid becomes a shiny, silky sauce.",
      "Season to Taste: Add salt, pepper, lemon juice, and a little fresh chopped parsley."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 20,
    "title": "Japanese Fluffy Soufflé Pancakes",
    "category": "Breakfast",
    "image": "https://images.unsplash.com/photo-1567620905732-2d1ec7ab7445?w=800&q=80",
    "time": "30 min",
    "servings": 2,
    "difficulty": "Medium",
    "description": "Incredibly light, fluffy, and jiggly pancakes that are a sensation from Japan. These soufflé pancakes are taller and airier than traditional pancakes, with a delicate, cloud-like texture that melts in your mouth.",
    "ingredients": [
      "2 eggs (at room temperature)",
      "2 tablespoons milk (30 ml)",
      "¼ teaspoon vanilla extract (optional)",
      "30g flour (approx. 3 tablespoons)",
      "½ teaspoon baking powder",
      "2 tablespoons sugar (adjust to taste)",
      "A few drops of lemon juice or vinegar (to stabilize the egg whites)",
      "Butter or oil (for the pan)",
      "A little water (for steam cooking)"
    ],
    "instructions": [
      "Separate the Eggs: Separate the egg whites from the yolks carefully. Place the whites in a clean, dry bowl, and reserve in the refrigerator (this helps them whip better).",
      "Prepare the Base: In the bowl with the yolks, add the milk and vanilla. Mix. Sift the flour and baking powder over the yolks and mix well until you have a smooth batter (it may seem thick, that's normal).",
      "Whip the Egg Whites: Take the egg whites out of the refrigerator. Add a few drops of lemon or vinegar.",
      "Whip the egg whites, and when they start to foam, add the sugar little by little while whipping. Continue whipping until you get stiff peaks (like meringue).",
      "Combine Whites and Base: Add ⅓ of the egg whites to the yolk and flour mixture. Mix carefully to lighten. Then, add the rest of the egg whites with gentle folding motions, to avoid deflating the air.",
      "Cook the Pancakes: Heat a non-stick skillet with a lid over low heat. Grease with a little butter or oil.",
      "Use a spoon or piping bag to form thick towers of batter (with height!). Add 1-2 tablespoons of water to the edge of the skillet (not on top of the pancakes), and cover immediately: this helps them cook with steam and rise well.",
      "Cooking: Cook covered for 4-5 minutes per side (low heat). Flip carefully (you can use two spatulas). If they are too pale, leave them a little longer without the lid at the end."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 21,
    "title": "Homemade Brioche Burger Buns",
    "category": "Baking",
    "image": "https://images.unsplash.com/photo-1572802419224-296b0aeee0d9?w=800&q=80",
    "time": "3 hrs 30 min",
    "servings": 8,
    "difficulty": "Medium",
    "description": "Soft, slightly sweet, and incredibly fluffy homemade brioche buns that will elevate any burger. With their golden-brown, shiny crust and tender crumb, these buns are far superior to store-bought and worth the effort.",
    "ingredients": [
      "500g bread flour (or all-purpose flour if you don't have it)",
      "10g salt",
      "50g sugar",
      "15g fresh yeast (or 5g dry yeast)",
      "3 medium eggs",
      "100ml whole milk (warm)",
      "100g butter (at room temperature, cubed)",
      "1 beaten egg (for egg wash)",
      "Sesame seeds (optional, for decoration)"
    ],
    "instructions": [
      "Activate the Yeast (if using dry): If using dry yeast, dissolve it in the warm milk with a pinch of sugar and let it sit for 10 minutes until frothy. If using fresh yeast, you can crumble it directly over the flour without activating.",
      "Make the Dough: In a bowl (or in a stand mixer): Mix flour, sugar, and salt. Add the eggs and milk (with the yeast).",
      "Knead until all ingredients are combined (about 5-10 minutes by hand, less if using a machine).",
      "Add the butter little by little while continuing to knead. The dough will be sticky but should become more elastic.",
      "🔁 Knead for a total of 15-20 minutes until you have a smooth, soft, and slightly sticky but manageable dough.",
      "First Rise (Fermentation): Form a ball with the dough and place it in a lightly greased bowl.",
      "Cover with plastic wrap or a damp cloth and let it rise for 1.5 to 2 hours at room temperature, or until doubled in size.",
      "Shape the Buns: Punch down the dough and divide it into portions of about 90–100g each (for burger-sized buns).",
      "Form smooth balls and place them on a baking tray lined with parchment paper, leaving space between them.",
      "Second Rise: Cover with a clean cloth and let them rest for one more hour, until they have grown again.",
      "Egg Wash and Bake: Preheat the oven to 180°C (350°F).",
      "Brush the buns with the beaten egg (you can add a tablespoon of milk to the egg for easier brushing).",
      "If desired, sprinkle sesame seeds on top.",
      "Bake: Bake for 15–18 minutes, until golden brown. Let cool on a wire rack."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 22,
    "title": "Risotto-Style Pasta with Cherry Tomatoes and Garlic",
    "category": "Main Dishes",
    "image": "https://images.unsplash.com/photo-1598866594230-a7c12756260f?w=800&q=80",
    "time": "25 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "Pasta cooked like risotto! This innovative method involves toasting the pasta and then slowly adding hot liquid, resulting in an incredibly creamy and flavorful dish with a silky sauce that clings to every strand. Burst cherry tomatoes and garlic add freshness and punch.",
    "ingredients": [
      "180g short pasta (penne, fusilli, rigatoni) or long (spaghetti, linguine)",
      "300g cherry tomatoes, halved",
      "3 garlic cloves, sliced",
      "3 tablespoons extra virgin olive oil",
      "700–800ml hot water or vegetable broth",
      "Salt to taste",
      "Black pepper to taste",
      "Fresh basil leaves (optional)",
      "Parmesan or pecorino cheese, grated (optional)"
    ],
    "instructions": [
      "Prepare the Base: In a large, wide skillet (like a sauté pan), add the olive oil and heat over medium heat.",
      "Add the sliced garlic and let it gently brown without burning.",
      "Add the cherry tomatoes with a pinch of salt and cook for 5–7 minutes, until they start to break down and release their juices.",
      "Add the Raw Pasta: Add the pasta directly to the skillet with the tomatoes. Mix well to coat it in the flavors.",
      "Cook Risotto-Style: Add a ladle of hot water or broth and cook over medium heat, stirring frequently.",
      "As the liquid is absorbed, continue adding more broth little by little, as you would with a risotto.",
      "Continue this process until the pasta is al dente (about 10–12 minutes total, depending on the pasta type).",
      "Adjust Flavor and Texture: When the pasta is cooked and creamy, adjust with salt and pepper.",
      "If desired, you can add an extra drizzle of olive oil or a knob of butter for shine.",
      "You can also incorporate grated cheese if desired (this thickens and enriches the sauce even more).",
      "Serve: Serve hot, with fresh basil leaves on top and more cheese if you like."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 23,
    "title": "Creamy Salmon Pasta",
    "category": "Main Dishes",
    "image": "https://platedcravings.com/wp-content/uploads/2022/04/Creamy-Salmon-Pasta-Plated-Cravings-9.jpg",
    "time": "25 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "A luxurious and comforting pasta dish featuring tender salmon in a rich, creamy sauce. The addition of thyme, basil, and a hint of orange zest adds wonderful aromatic complexity that elevates this simple weeknight dinner.",
    "ingredients": [
      "200g pasta (tagliatelle, penne, spaghetti, etc.)",
      "150–200g salmon (fresh or smoked)",
      "200ml cooking cream",
      "½ onion (optional)",
      "1 garlic clove (optional)",
      "A splash of olive oil, butter",
      "Salt and pepper to taste",
      "Dill or parsley, thyme and basil",
      "Orange zest (only the orange part)"
    ],
    "instructions": [
      "Cook the Pasta: Cook the pasta in plenty of salted water according to package directions. Reserve a little of the pasta cooking water before draining.",
      "Prepare the Salmon: If using fresh salmon: cut it into small cubes and cook it in a skillet with a little oil until done (about 3-4 minutes).",
      "If using smoked salmon: simply cut it into thin strips (no need to cook).",
      "Sauté: Sauté some chopped onion and garlic in the skillet with olive oil until golden and soft. Add butter, cherry tomatoes, then add thyme and basil. Then add the salmon.",
      "Add the Cream: Add the cream to the skillet. Cook over medium-low heat for a few minutes until slightly thickened. Add salt and pepper to taste.",
      "Combine with Pasta: Add the cooked pasta to the skillet. If the sauce is too thick, add a little of the reserved pasta water. Mix well.",
      "Final Touch (Optional): Grate a little orange zest over the top for freshness. Garnish with chopped dill or parsley."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 24,
    "title": "Hake with Ginger and Soy",
    "category": "Main Dishes",
    "image": "https://rasamalaysia.com/wp-content/uploads/2019/01/ginger-soy-fish.jpg",
    "time": "25 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "A light, healthy, and incredibly flavorful fish dish. Hake fillets are marinated in a vibrant Asian-inspired sauce with fresh ginger, garlic, and soy, then quickly pan-seared to perfection. A simple yet impressive weeknight meal.",
    "ingredients": [
      "4 hake fillets (fresh or thawed)",
      "2-3 cm fresh ginger, peeled and grated",
      "2 garlic cloves, finely chopped",
      "3 tablespoons soy sauce",
      "1 tablespoon sesame oil (optional, but highly recommended)",
      "Juice of ½ lemon or lime",
      "1 teaspoon honey (optional, to balance the flavor)",
      "2 tablespoons olive oil",
      "Salt and black pepper to taste",
      "Green onion or fresh cilantro for garnish"
    ],
    "instructions": [
      "Prepare the Marinade: In a bowl, mix the soy sauce, sesame oil, grated ginger, garlic, lemon juice, and honey.",
      "Marinate the Hake: Place the hake fillets on a plate and pour the marinade over them. Let them rest for 15-20 minutes in the refrigerator.",
      "Cook the Fish: Heat the olive oil in a large skillet over medium heat.",
      "Cook the fillets for 3-4 minutes per side (depending on thickness), until golden and they flake easily with a fork.",
      "Add the Remaining Marinade: Pour the remaining marinade into the skillet and let it boil for a minute to thicken slightly.",
      "Serve and Garnish: Place the hake on the plate, cover with the sauce, and garnish with green onion or fresh cilantro."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 25,
    "title": "Baked Monkfish with Warm Kiwi and Lime Sauce",
    "category": "Main Dishes",
    "image": "https://static01.nyt.com/images/2017/03/29/dining/29KITCHEN1/29KITCHEN1-facebookJumbo-v2.jpg",
    "time": "30 min",
    "servings": 2,
    "difficulty": "Medium",
    "description": "An elegant and surprising dish where the firm, sweet flesh of monkfish meets a vibrant, slightly tropical sauce made from fresh kiwi and lime. The result is a beautifully balanced main course that is both sophisticated and refreshing.",
    "ingredients": [
      "For the monkfish:",
      "2 monkfish tails, cleaned (150–180g each)",
      "Sea salt and white pepper",
      "1 tbsp extra virgin olive oil",
      "½ tsp butter",
      "For the kiwi sauce:",
      "2 ripe kiwis, peeled and chopped",
      "½ shallot or small spring onion",
      "1 tsp honey or brown sugar (to balance acidity)",
      "Juice of ½ lime",
      "1 tbsp dry white wine or vermouth",
      "1 tbsp mild olive oil"
    ],
    "instructions": [
      "Bake the Monkfish: Preheat the oven to 190°C.",
      "Season the fillets with salt and pepper, rub them with a little oil and butter.",
      "Bake them for 10–12 minutes, until white and juicy (do not overcook).",
      "👉 Tip: you can also steam it if you prefer a cleaner flavor.",
      "Prepare the Kiwi Sauce: In a skillet, sauté the very finely chopped shallot with a little oil over low heat.",
      "Add the kiwi pieces and honey, cook for 2 minutes.",
      "Add the white wine and let it reduce for 1-2 minutes.",
      "Incorporate the lime juice and blend everything with a blender until you get a smooth sauce.",
      "Strain it if you want a finer texture.",
      "Adjust the acidity and sweetness (the balance is key: not too acidic, not too sweet).",
      "Serve the monkfish with the warm kiwi sauce."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 26,
    "title": "Salmon with Orange Zest and Soy Sauce",
    "category": "Main Dishes",
    "image": "https://images.unsplash.com/photo-1467003909585-2f8a72700288?w=800&q=80",
    "time": "30 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "A stunning salmon dish where the rich flavor of the fish is perfectly complemented by a sweet and savory glaze made from orange zest, soy sauce, and honey. It's quick to make but tastes gourmet, with a beautiful caramelized exterior.",
    "ingredients": [
      "2 salmon fillets (150–200g each)",
      "2 tablespoons soy sauce",
      "1 tablespoon honey or maple syrup (optional, to balance acidity)",
      "Zest of 1 orange",
      "Juice of ½ orange (about 3–4 tablespoons)",
      "1 garlic clove, minced (optional)",
      "1 teaspoon fresh ginger, grated (optional, adds an Asian touch)",
      "1 tablespoon olive oil or sesame oil",
      "Black pepper to taste",
      "Sesame seeds and chopped chives (for garnish, optional)"
    ],
    "instructions": [
      "Make the Marinade: In a bowl, mix: Soy sauce -> Orange juice and zest -> Honey (if using) -> Garlic and ginger -> A splash of oil.",
      "Stir well until you have a homogeneous mixture.",
      "Marinate the Salmon: Place the fillets on a plate or in a zip-top bag and cover them with the marinade.",
      "Let them rest for 20 to 30 minutes in the refrigerator (if you're in a hurry, 10 minutes also works).",
      "Cook the Salmon: Heat a non-stick skillet over medium-high heat with a little oil.",
      "Place the salmon skin-side down (if it has skin).",
      "Cook for about 3–4 minutes until the bottom is golden and crispy.",
      "Then carefully flip it and cook for another 2–3 minutes on the other side, depending on thickness.",
      "👉 The interior should remain pink and juicy, not completely dry.",
      "Optional: Reduce the remaining marinade in a small pan until slightly thickened and serve over the salmon.",
      "Garnish with sesame seeds and chives or extra orange zest."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
    {
    "id": 27,
    "title": "Homemade French Fries",
    "category": "Side Dishes",
    "image": "https://images.unsplash.com/photo-1573080496219-bb080dd4f877?w=800&q=80",
    "time": "50 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "The ultimate guide to perfect homemade French fries - crispy and golden on the outside, fluffy and tender on the inside. The double-frying technique ensures they stay crispy longer and have that authentic texture we all love.",
    "ingredients": [
      "2-3 medium potatoes (about 500g)",
      "Oil for frying (sunflower or mild olive oil)",
      "Salt to taste",
      "(Optional: a little paprika, garlic powder, or rosemary for a different twist)"
    ],
    "instructions": [
      "Peel and Cut the Potatoes: Peel the potatoes (or wash them well if you prefer to leave the skin on). Cut them into sticks of the same thickness (approx. 1 cm wide).",
      "👉 The thinner they are, the crispier; the thicker they are, the softer inside.",
      "Soak Them: Place the cut potatoes in a bowl with cold water for 30 minutes (or up to 1 hour). This removes excess starch and prevents them from sticking or becoming soggy when frying.",
      "Dry Them Well: Drain them and dry them with a cloth or paper towels.",
      "🔥 This step is very important: if they have water, the oil will splatter and the potatoes will steam instead of fry.",
      "First Fry (to cook): Heat the oil to 150°C (medium heat). Fry the potatoes in batches for 5-7 minutes, until soft but not golden. Remove and let them rest on paper towels.",
      "Second Fry (to brown and crisp): Increase the oil temperature to 180-190°C (high heat). Fry the potatoes again for 2-3 minutes until golden and crispy. Remove, place on paper to absorb excess oil, and sprinkle with salt while still hot."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
    {
    "id": 28,
    "title": "Soy Mayonnaise Sauce",
    "category": "Sauces",
    "image": "https://img.sunset02.com/sites/default/files/spicy-soy-mayo-su.jpg",
    "time": "5 min",
    "servings": 2,
    "difficulty": "Easy",
    "description": "An incredibly simple yet addictive dipping sauce. The umami-rich saltiness of soy sauce perfectly cuts through the richness of mayonnaise, creating a versatile condiment that's fantastic with fries, roasted vegetables, grilled meats, or as a sandwich spread.",
    "ingredients": [
      "Mayonnaise",
      "Soy sauce"
    ],
    "instructions": [
      "Mix mayonnaise with soy sauce. The ratio should be about 4 parts mayonnaise to 1 part soy sauce.",
      "Add the soy sauce little by little and taste as you go to adjust to your preference."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 29,
    "title": "Crispy Spiced Roasted Chickpeas",
    "category": "Snacks",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSekbrm0MsjPNVo3H2N6JaEHR7cNKxxVa_omg&s",
    "time": "40 min",
    "servings": 3,
    "difficulty": "Easy",
    "description": "A healthy and addictive snack - chickpeas roasted to perfection with aromatic spices until incredibly crispy. These make a fantastic protein-packed snack, salad topper, or soup garnish that's much healthier than traditional chips.",
    "ingredients": [
      "1 can (400g) cooked chickpeas",
      "1 tablespoon olive oil",
      "½ teaspoon sweet paprika",
      "½ teaspoon cumin powder",
      "¼ teaspoon garlic powder",
      "Pinch of salt",
      "(Optional) a pinch of curry, chili powder, or dried rosemary to vary the flavor"
    ],
    "instructions": [
      "Preheat the oven to 200°C (392°F).",
      "Drain and rinse the chickpeas. Dry them very well with paper towels or a clean cloth (this step is key to getting them crispy).",
      "Place the chickpeas in a bowl, add the oil and spices. Mix well until all are coated.",
      "Spread the chickpeas on a baking tray with parchment paper, forming a single layer.",
      "Bake for 30-40 minutes, stirring every 10-15 minutes, until golden and crispy.",
      "Let them cool for a few minutes before serving."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 30,
    "title": "Creamy Salmon Puree Soup",
    "category": "Soups",
    "image": "https://images.unsplash.com/photo-1547592166-23ac45744acd?w=800&q=80",
    "time": "50 min",
    "servings": 4,
    "difficulty": "Medium",
    "description": "An ultra-creamy and luxurious salmon soup where the fish is first seared to perfection then blended into a velvety puree with potatoes and carrots. The homemade salmon stock from heads and bones adds incredible depth of flavor.",
    "ingredients": [
      "300g fresh salmon fillets (skinless and boneless) plus salmon head and bones",
      "1 medium potato, peeled and cubed",
      "1 carrot, sliced",
      "1 leek (white part only) or ½ chopped onion",
      "1 garlic clove, chopped",
      "1 tablespoon butter or olive oil",
      "1.5L water",
      "100ml cooking cream",
      "Salt and pepper to taste",
      "50g cheddar cheese",
      "A few drops of lemon juice (optional)",
      "Dill, cilantro or fresh parsley, chopped for garnish",
      "Sesame seeds (for garnish)"
    ],
    "instructions": [
      "Make Salmon Stock: In a pot, sear the salmon head and bones for 5 minutes over medium heat, then add 1.5L of water. Increase heat and when it boils, reduce to low-medium and maintain for 25 minutes. Then strain through a colander - your stock is ready.",
      "Base Sauté: In a large pot, melt the butter (or heat the oil). Add the leek (or onion) and garlic, and sauté over medium heat until tender and fragrant (about 5 minutes).",
      "Add Vegetables: Add the potato and carrot. Cook for a few more minutes, stirring.",
      "Add Liquid: Pour in the salmon stock and bring to a boil. Reduce heat and simmer for about 5 minutes.",
      "Blend: Transfer everything with the stock to a Thermomix (or blender) and blend, adding cream, cheddar cheese, and butter.",
      "Cook the Salmon: Cut the salmon into medium pieces and fry them in a pan over medium heat until golden.",
      "Combine: Add the seared salmon to the blended soup.",
      "Serve: Serve hot garnished with fresh herbs and sesame seeds."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  },
  {
    "id": 31,
    "title": "Pasta with Black Pepper Sauce",
    "category": "Main Dishes",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTVcHjfsJ1e5Xo9WvbzfPPMy-rgl2IJtRB1dQ&s",
    "time": "25 min",
    "servings": 1,
    "difficulty": "Easy",
    "description": "A quick and flavorful pasta dish where the pasta cooks directly in the pan with vegetables, absorbing all the flavors. The black pepper sauce adds a wonderful warmth and complexity to this simple yet satisfying meal.",
    "ingredients": [
      "½ onion",
      "1 garlic clove",
      "80-100g pasta",
      "½ tomato",
      "40g butter",
      "Cilantro (to taste)",
      "Water",
      "Spinach (to taste)",
      "Salt",
      "Black pepper",
      "White wine",
      "1 spoon black pepper sauce (see recipe below)"
    ],
    "instructions": [
      "Sauté Vegetables: Chop onion and garlic and place them in a skillet with half the butter and a splash of oil.",
      "Cook the Pasta: Cook the pasta separately according to package directions.",
      "When the vegetables are golden, add the cooked pasta and gradually add water for 7 minutes until the pasta is fully cooked.",
      "Make the Sauce: In the same skillet, add diced tomato, finely chopped cilantro, black pepper sauce, and remaining butter. Mix everything well.",
      "When everything reaches a creamy consistency, add spinach and it's ready to serve."
    ],
    "videoUrl": "https://www.youtube.com/embed/K5oXnXp-XxM"
  }
]